GHB2/src/Catalogs/гхб_Домены/гхб_Домены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_Домены</name>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/Catalogs/гхб_Домены/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьДоменПоНазванию(_Название) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_Домены.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.гхб_Домены КАК гхб_Домены
	               |ГДЕ
	               |	НЕ гхб_Домены.ПометкаУдаления
	               |	И НЕ гхб_Домены.НеИспользовать
	               |	И (гхб_Домены.Наименование = &Наименование
	               |	ИЛИ гхб_Домены.КраткоеНаименование = &Наименование)";
	
	Запрос.УстановитьПараметр("Наименование", _Название);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Справочники.гхб_Домены.ПустаяСсылка());
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
